# ExternalResourceLoadContext Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceLoadContext Properties
ExternalResourceLoadContext Class See Also
---
The ExternalResourceLoadContext type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LoadOperationType | An enum value indicating whether the resource load was triggered by an automatic event (such as file open) or an explicit user action. |

# See Also
ExternalResourceLoadContext Class
Autodesk.Revit.DB Namespace